app/backend/artillery.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: "Ramp up"
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
  plugins:
    ensure: {}
  ensure:
    thresholds:
      - http.response_time.p95: 1000
      - http.request_rate: 10

scenarios:
  - name: "Health check"
    weight: 30
    requests:
      - get:
          url: "/api/health"

  - name: "Login + Dashboard"
    weight: 40
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "admin@simply-gmao.local"
            password: "Simply GMAO2025!"
          capture:
            - json: "$.data.accessToken"
              as: "token"
      - get:
          url: "/api/dashboard/kpis"
          headers:
            Authorization: "Bearer {{ token }}"

  - name: "List equipments"
    weight: 30
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "admin@simply-gmao.local"
            password: "Simply GMAO2025!"
          capture:
            - json: "$.data.accessToken"
              as: "token"
      - get:
          url: "/api/equipments?page=1&limit=20"
          headers:
            Authorization: "Bearer {{ token }}"